controllers/LoginController.php

    public function actionLogin()
    {
        $request = Yii::$app->request->post();
        $username = $request['username'] ?? null;
        $password = $request['password'] ?? null;

        if (!$username || !$password) {
            throw new BadRequestHttpException('Username and password are required.');
        }

        $user = User::findByUsername($username);

        if (!$user) {
            throw new UnauthorizedHttpException('User not found.');
        }

        if (!$user->validatePassword($password)) {
            throw new UnauthorizedHttpException('Invalid password.');
        }

        $accessToken = JwtHelper::generateAccessToken($user);
        $refreshToken = JwtHelper::generateRefreshToken($user);

         // Store refresh token in the database
         $user->refresh_token = $refreshToken;
         if (!$user->save()) {
---
UPDATE `user` SET `refresh_token`='eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpYXQiOjE3MjY0ODgxMjcsImV4cCI6MTcyOTA4MDEyNywiZGF0YSI6eyJ1c2VyX2lkIjoxfX0.t12EXuvQiyrcDH1toeCOnEWpkuEl_br-xdoYBx6Eqgg' WHERE `id`=1

    public function actionRefreshToken()
    {
        $request = Yii::$app->request;
        $refreshToken = $request->post('refresh_token');

        if (!$refreshToken) {
            throw new BadRequestHttpException('Refresh token is required.');
        }

        // Find user by refresh token
        $user = User::findOne(['refresh_token' => $refreshToken]);
---
SELECT * FROM `user` WHERE `refresh_token`='eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpYXQiOjE3MjY0Mzc2ODgsImV4cCI6MTcyOTAyOTY4OCwiZGF0YSI6eyJ1c2VyX2lkIjoxfX0.EOnFaAra_v5TBrQLYeOioCkgGS9MOiqE5Tv2okL3v3w'