models/User.php

    public static function findIdentityByAccessToken($token, $type = null)
    {
        $decoded = JwtHelper::validateToken($token);

        if ($decoded && isset($decoded->data->user_id)) {
            return self::findOne($decoded->data->user_id);
---
SELECT * FROM `user` WHERE `id`=1

    public static function findByUsername($username)
    {
        return self::findOne(['username' => $username]);
---
SELECT * FROM `user` WHERE `username`='fer'